
&НаКлиенте
Процедура СтартНавигации(Команда)
	
	ПроверкаДатыНаЧётность = День(ТекущаяДата) % 2;
	
	ДатаНачалаНавигации = ТекущаяДата;
	
	ОстатокСельдиНаСкладе = 0;
	ОстатокТрескиНаСкладе = 0;
	ОстатокЛососяНаСкладе = 0;
	
	ПриходСельдиЗаДень = 40;
	ПриходТрескиЗаДень = 64;
	ПриходЛососяЗаДень = 82;
	
	Пока ТекущаяДата <= ДатаКонцаНавигации Цикл
		
		Если ДеньНедели(ТекущаяДата) = 1 Тогда ОстатокСельдиНаСкладе = ОстатокСельдиНаСкладе + 0
			
			//Приход рыбы на склад
			ИначеЕсли ПроверкаДатыНаЧётность = 0 Тогда ОстатокСельдиНаСкладе = ОстатокСельдиНаСкладе + ПриходСельдиЗаДень
			ИначеЕсли ПроверкаДатыНаЧётность > 0 Тогда ОстатокТрескиНаСкладе = ОстатокТрескиНаСкладе + ПриходТрескиЗаДень
			ИначеЕсли День(ТекущаяДата) = 15 Тогда ОстатокЛососяНаСкладе = ОстатокЛососяНаСкладе + ПриходЛососяЗаДень
			
			//Расход рыбы со склада
			ИначеЕсли ДеньНедели(ТекущаяДата) = 1 Тогда ОстатокСельдиНаСкладе = ОстатокСельдиНаСкладе - 15
			ИначеЕсли ДеньНедели(ТекущаяДата) = 2 Тогда ОстатокТрескиНаСкладе = ОстатокТрескиНаСкладе - 18
			ИначеЕсли ДеньНедели(ТекущаяДата) = 3 Тогда ОстатокСельдиНаСкладе = ОстатокСельдиНаСкладе - 5 и ОстатокТрескиНаСкладе = ОстатокТрескиНаСкладе - 5
			ИначеЕсли ДеньНедели(ТекущаяДата) = 4 Тогда ОстатокСельдиНаСкладе = ОстатокСельдиНаСкладе - 5
			ИначеЕсли ДеньНедели(ТекущаяДата) = 5 Тогда ОстатокТрескиНаСкладе = ОстатокТрескиНаСкладе - 18
			ИначеЕсли ДеньНедели(ТекущаяДата) = 6 или ДеньНедели(ТекущаяДата) = 7 Тогда ОстатокЛососяНаСкладе = ОстатокЛососяНаСкладе - 5
				
			//Статус истощения запасов на складе
			ИначеЕсли ОстаткиСельдиНаСкладе = 0 и ОстатокТрескиНаСкладе = 0 и ОстатокЛососяНаСкладе = 0 Тогда Сообщить("На складе запасы рыбы закончились на дату:" + ТекущаяДата)
		Иначе Сообщить("Остаток сельди на конец навигации" + ОстатокСельдиНаСкладе + "Остаток трески на конец навигации:" + ОстатокТрескиНаСкладе + "Остаток лосося на конец навигации:" + ОстатокЛососяНаСкладе)
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
